OdDbSetBasePlotSettingsPE.setPlotRotation(OdRxObject*,OdDbBaseLayoutPE.PlotRotation)
\details
Sets the plot rotation for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param plotRotation [in]  Plot rotation.
\remarks
plotRotation must be one of the following:
Name         Value    Description
k0degrees    0        No rotation
k90degrees   1        90° CCW
k180degrees  2        Inverted°
k270degrees  3        90° CW
\returns Returns eOk if successful or an appropriate error code otherwise.